Dlubal.RFEM5.MemberEffectiveLengths
Member effective lengths

Dlubal.RFEM5.MemberEffectiveLengths.No
Member number

Dlubal.RFEM5.MemberEffectiveLengths.Enabled
Indicates if the effective lengths are enabled for the member of the selected type.

Dlubal.RFEM5.MemberEffectiveLengths.FactorY
Effective length factor kcr,y

Dlubal.RFEM5.MemberEffectiveLengths.FactorZ
Effective length factor kcr,z

Dlubal.RFEM5.MemberEffectiveLengths.FactorU
Effective length factor kcr,u

Dlubal.RFEM5.MemberEffectiveLengths.FactorV
Effective length factor kcr,v

Dlubal.RFEM5.MemberEffectiveLengths.EffectiveLengthY
Effective length Lcr,y

Dlubal.RFEM5.MemberEffectiveLengths.EffectiveLengthZ
Effective length Lcr,z

Dlubal.RFEM5.MemberEffectiveLengths.EffectiveLengthU
Effective length Lcr,u

Dlubal.RFEM5.MemberEffectiveLengths.EffectiveLengthV
Effective length Lcr,v

Dlubal.RFEM5.MemberEffectiveLengths.CriticalBucklingLoad
Critical buckling load Ncr

Dlubal.RFEM5.MemberEffectiveLengths.CheckBucklingLoad
Check exceeding of critical buckling load on calculation